CAnimationVariableChangeHandler.OnValueChanged(IUIAnimationStoryboard*,IUIAnimationVariable*,System.Double,System.Double)
Called when a value of an animation variable has changed.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
storyboard: The storyboard that is animating the variable.
variable: The animation variable that was updated.
newValue: The new value.
previousValue: The previous value.

CAnimationVariableChangeHandler.SetAnimationController(CAnimationController*)
Stores a pointer to animation controller to route events.
pAnimationController: A pointer to animation controller, which will receive events.

CAnimationVariableChangeHandler.CreateInstance(CAnimationController*,IUIAnimationVariableChangeHandler**)
Creates an instance of CAnimationVariableChangeHandler object.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pAnimationController: A pointer to animation controller, which will receive events.
ppHandler: Output. If the method succeeds it contains a pointer to COM object that will handle
variable change events.

CAnimationVariableChangeHandler.#ctor
Constructs a CAnimationVariableChangeHandler object.

CAnimationVariableChangeHandler
Implements a call back, which is called by Animation API when the value of an animation variable changes.
Remarks:
This event handler is created and passed to IUIAnimationVariable::SetVariableChangeHandler method,
when you call CAnimationVariable::EnableValueChangedEvent or CAnimationBaseObject::EnableValueChangedEvent
(which enables this event for all animation variables encapsulated in an animation object).